/* CMSMAKE31 EXEC -- builds cREXX (2022 S370 tree) on VM/370+        */
/* As CMSMAKE EXEC, but every compile runs GCC380 (AMODE 31, heap    */
/* above 16 MB, via GCC31 EXEC) and RXBVM -- 'Out of memory - todo'  */
/* in the original -- is built.                                       */
SOURCE_DISK = 'D'
BINARY_DISK = 'E'
BUILD_RESULT = 0
'GLOBAL TXTLIB GCCLIB'
CALL BUILD
SAY "RXC -V";   'RXC -V'
SAY "RXAS -V";  'RXAS -V'
SAY "RXDAS -V"; 'RXDAS -V'
SAY "RXBVM -V"; 'RXBVM -V'
IF BUILD_RESULT > 0 THEN SAY "***** THERE WERE BUILD ERRORS *****"
EXIT BUILD_RESULT

BUILD: PROCEDURE EXPOSE SOURCE_DISK BINARY_DISK RESULT BUILD_RESULT
  PARM = "CREXX"
  RESULT = 0
  CALL COMPILE "CMSUTIL"
  CALL COMPILE "AVL_TREE"
  CALL COMPILE "RXVMINST"
  IF BUILD_RESULT > 0 THEN RETURN
  /* COMPILER */
  RESULT = 0
  CALL COMPILE "RXCPMAIN"
  CALL COMPILE "RXCPAST"
  CALL COMPILE "RXCPOSCN"
  CALL COMPILE "RXCPOPGR"
  CALL COMPILE "RXCPOPAR"
  CALL COMPILE "REXBSCAN"
  CALL COMPILE "RXCPBGMR"
  CALL COMPILE "RXCPBPAR"
  CALL COMPILE "RXCPBVAL"
  CALL COMPILE "RXCPSYMB"
  CALL COMPILE "RXCPEMIT"
  CALL COMPILE "RXCP_OPT"
  IF RESULT = 0 THEN CALL LINK "RXC",
    "RXCPMAIN RXCPAST RXCPOSCN RXCPOPGR RXCPOPAR REXBSCAN RXCPBGMR",
    "RXCPBPAR RXCPBVAL RXCPSYMB RXCP_OPT RXCPEMIT RXVMINST AVL_TREE",
    "CMSUTIL"
  /* ASSEMBLER */
  RESULT = 0
  CALL COMPILE "RXASSCAN"
  CALL COMPILE "RXASGRMR"
  CALL COMPILE "RXASMAIN"
  CALL COMPILE "RXASTOKE"
  CALL COMPILE "RXASEROR"
  CALL COMPILE "RXASASSM"
  CALL COMPILE "RXAS_OPT"
  IF RESULT = 0 THEN CALL LINK "RXAS",
    "RXASSCAN RXASGRMR RXASMAIN RXASTOKE RXASEROR RXASASSM RXVMINST",
    "RXAS_OPT AVL_TREE CMSUTIL"
  /* BYTECODE INTERPRETER -- 'Out of memory - todo' on stock CE */
  RESULT = 0
  CALL COMPILE "RXVMMAIN"
  CALL COMPILE "RXVMINTP"
  IF RESULT = 0 THEN CALL LINK "RXBVM",
    "RXVMMAIN RXVMINTP RXVMINST AVL_TREE CMSUTIL"
  /* DISASSEMBLER */
  RESULT = 0
  CALL COMPILE "RXDAMAIN"
  CALL COMPILE "RXDADISM"
  IF RESULT = 0 THEN CALL LINK "RXDAS",
    "RXDAMAIN RXDADISM RXVMINST AVL_TREE CMSUTIL"
RETURN

LINK: PROCEDURE EXPOSE BINARY_DISK BUILD_RESULT
  PARSE ARG NAME TEXTS
  SAY "LINKING" NAME
  "LOAD" TEXTS
  IF RC > 0 THEN BUILD_RESULT = RC
  "GENMOD" NAME
  IF RC > 0 THEN BUILD_RESULT = RC
  "COPYFILE" NAME "MODULE A = =" BINARY_DISK "(REPLACE"
RETURN

COMPILE: PROCEDURE EXPOSE SOURCE_DISK RESULT PARM BUILD_RESULT
  ARG FILE
  SAY "COMPILING" FILE
  "EXEC GCC31" FILE "C" SOURCE_DISK "(CMS PARM" PARM
  IF RC > 0 THEN RESULT = RC
  IF RESULT > 0 THEN BUILD_RESULT = RESULT
RETURN
