/* BASIC EXEC -- BASIC in cREXX (github.com/mikebeer/basic) on VM/370plus   */
/*   BASIC [-MS|-FB|-ANSI] fn.bas [args]   run a BASIC program          */
/*   BASIC                                 interactive prompt           */
/* Runs BASIC RXBIN (linked with RXFLOAT and the library) on RXBVM8.    */
PARSE ARG ARGS
'STATE BASIC RXBIN *'
IF RC <> 0 THEN DO
  SAY 'BASIC: BASIC RXBIN not found -- access the disk that has it'
  EXIT 28
END
IF ARGS = '' THEN 'RXBVM8 BASIC'
ELSE DO
  QUEUE ARGS              /* CMS would cut each argument to 8 chars */
  'RXBVM8 BASIC -a =STACK'
END
EXIT RC
